# AreaOfCurveLoop Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostObjectSubcomponentInfo..::..AreaOfCurveLoop Property
HostObjectSubcomponentInfo Class See Also
---
The area of the CurveLoop of the roof or floor slab.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double AreaOfCurveLoop { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AreaOfCurveLoop As Double
	Get
```

Visual C++
---
```text
public:
property double AreaOfCurveLoop {
	double get ();
}
```

# See Also
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace